# Пользователь вводит предложение, заменить все пробелы на "-" 2-мя
# способами

sentense = "I find some interesting information"
print(sentense.replace(' ', '-'))

word1 = "I"
word2 = "find"
word3 = "some"
word4 = "interesting"
word5 = "information"
print(word1, word2, word3, word4, word5, sep='-')