# Завершите функцию суммы квадратов так,
# чтобы она возводила в квадрат каждое переданное в нее число, а затем суммировала результаты.



# def square_sum(numbers):
    #your code here


# numbers = [3, 4]
# for i in numbers:
#     i **= 2

# def sq(numbers= list):
#     num_kv = [i **2 for i in numbers]
#     return sum(num_kv)
#
#
#
# print(sq([2, 3]))


# Напишите функцию, которая принимает массив слов, объединяет их в предложение и
# возвращает это предложение. Вы можете игнорировать необходимость очистки слов или
# добавления знаков препинания, но вам следует добавлять пробелы между каждым словом.
# Будьте внимательны: ни в начале, ни в конце предложения не должно быть пробела!

# words = ['hello', 'world', 'beautiful']
# # b = ' '.join(n)
# # print(b)
#
# def smash(words):
#     return ' '.join(words)
#
# print(smash(words))

# Напишите программу, которая находит сумму всех чисел от 1 до num.
# Число всегда будет положительным целым числом, большим 0.
# Вашей функции нужно только вернуть результат. В приведенном
# ниже примере в скобках показано, как вы достигаете этого результата,
# и оно не является его частью

# n = 2
# for i in range(1, n+1):
#     b = [i in range]